/*************************************************************************************
 *
 * 文 件 名:   ChapterEightTest.h
 * 描    述: 
 * 
 * 版    本：  V1.0
 * 创 建 者：  01
 * 创建时间：  2021/8/7 23:48
 * ======================================
 * 历史更新记录
 * 版本：V          修改时间：         修改人：
 * 修改内容：
 * ======================================
*************************************************************************************/
// Copyright (c) 2011 rubicon IT GmbH
#pragma once
#include "SSTable.h"
#include<deque>
class ChapterEightTest
{
public:
	//使用非递归方法实现快速排序
	void one(SSTable &s,int n);

	//双冒泡排序
	void two(SSTable &s,int n);

	//查找k小元素
	int five(SSTable& s,int k);
};

