/*************************************************************************************
 *
 * 文 件 名:   main.cpp
 * 描    述: 
 * 
 * 版    本：  V1.0
 * 创 建 者：  01
 * 创建时间：  2021/7/7 11:17
 * ======================================
 * 历史更新记录
 * 版本：V          修改时间：         修改人：
 * 修改内容：
 * ======================================
*************************************************************************************/
// Copyright (c) 2011 rubicon IT GmbH
#include <array>
#include <vector>
#include "SqList.h"
#include "BitNode.h"

int main()
{
	int n=100;
	
	while (0<----n)
	{
		
		cout << n <<" "<< endl;
	}
	
	return 0;
}